БИТУправление_медицинским_центром_демо/src/Documents/РассылкаПисемEmail/РассылкаПисемEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаПисемEmail</name>
  <attributes>
    <name>УчетнаяЗапись</name>
    <comment>Учетная запись электронной почты</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ПисьмоEMAIL</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставитьСообщениеВУказанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СообщенияSMS/СообщенияSMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияSMS</name>
  <resources>
    <name>КонтактПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическойОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоОтправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОбОтправке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <comment>Внешний идентификатор сообщения, для связи с сервисом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.ВидыСообщенийРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнутреннийИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусОтправки</name>
    <type>
      <types>EnumRef.СтатусыОтправкиСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусыОтправкиСообщений/СтатусыОтправкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиСообщений</name>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлена</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/РассылкаПисемEmail/ObjectModule.bsl
#Область ПрограммныйИнтерфейс
// Функция ОтправитьНеотправленныеСообщения.
//
// Параметры:
//  НаборЗаписейСообщения - РегистрыСведенийНаборЗаписей.СообщенияEmail - сообщения документа.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ОтправитьНеотправленныеСообщения(НаборЗаписейСообщения = Неопределено) Экспорт
	РезультатОтправки = РассылкаСообщенийEMAIL.ОтправитьНеотправленныеСообщения(Ссылка);
	Возврат РезультатОтправки;
КонецФункции

// Обновляет статусы сообщений документа по состоянию отправки.
//
Процедура УстановитьСтатусСообщенийПоДокументу() Экспорт
	
	НаборЗаписейСообщения = РегистрыСведений.СообщенияSMS.СоздатьНаборЗаписей();
	НаборЗаписейСообщения.Отбор.Рассылка.Установить(Ссылка);
	НаборЗаписейСообщения.Прочитать();
	Для Каждого Запись Из НаборЗаписейСообщения Цикл
		Если Проведен И Запись.СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.ПустаяСсылка() Тогда
			СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.НеОтправлено;
		ИначеЕсли Не Проведен И Запись.СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.НеОтправлено Тогда
			СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.ПустаяСсылка();
		КонецЕсли;
		Если Запись.СтатусОтправки <> СтатусОтправки Тогда
			Запись.СтатусОтправки = СтатусОтправки;
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейСообщения.Модифицированность() Тогда
		НаборЗаписейСообщения.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Перезаполнляет текст сообщений по виду сообщения рассылки.
//
// Параметры:
//  ТабСообщения - ТаблицаЗначений	 - сообщения.
//
Процедура ЗаполнитьТекстПоВидамСообщений(ТабСообщения) Экспорт
	
	ТабВидыСообщений = ТабСообщения.Скопировать();
	ТабВидыСообщений.Свернуть("ВидСообщения");
	
	ДанныеВидовСообщений = СМС_ФормированиеСообщений.ПолучитьДанныеВидовСообщений(ТабВидыСообщений.ВыгрузитьКолонку("ВидСообщения"));
	
	Для Каждого СтрокаВидСообщения Из ТабВидыСообщений Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаВидСообщения.ВидСообщения) Тогда
			Продолжить
		КонецЕсли;
		
		Если ДанныеВидовСообщений.НайтиСледующий(Новый Структура("ВидСообщения",СтрокаВидСообщения.ВидСообщения)) Тогда
			
			мсСтрокиСообщения = ТабСообщения.НайтиСтроки(Новый Структура("ВидСообщения",СтрокаВидСообщения.ВидСообщения));
			Для Каждого СтрокаСообщения Из мсСтрокиСообщения Цикл
				
				СтрокаСообщения.Текст = СМС_ФормированиеСообщений.ВычислитьТекстСообщения(ДанныеВидовСообщений, СтрокаСообщения);	
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	           
	Если Не Проведен Тогда
		УстановитьСтатусСообщенийПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
